//* DIVISIBILITY KEYS
export const divisibilityMap = {
  2: "જો આપેલ સંખ્યા નો એકમનો અંક 2, 4, 6, 8 અથવા 0 હોય એટલેકે જો આપેલ સંખ્યા બેકી સંખ્યા હોય તો તેને 2 વડે નિશેષ ભાગી શકાય.",
  3: "આપેલ સંખ્યા ૩ વડે વિભાજ્ય છે કે નહિ તે જાણવા માટે તેના અંકો નો સરવાળો કરો. જો મળતો જવાબ ૩ વડે વિભાજ્ય હોય તો આપેલ સંખ્યા પણ ૩ વડે વિભાજ્ય છે તેમ કહેવાય.",
  4: "જો આપેલ સંખ્યા નાં છેલ્લા બે અંકો (દશક અને એકમના અંકો) દ્વારા રચાયેલી સંખ્યા 4 વડે ભાગી શકાય તો આપેલ સંખ્યાને પણ 4 વડે ભાગી શકાય.",
  5: "જો આપેલ સંખ્યાનો એકમનો અંક 0 અથવા 5 હોય તો તે સંખ્યા 5 વડે વિભાજ્ય છે તેમ કહેવાય.",
  6: "જો આપેલ સંખ્યાને 2 અને 3 વડે ભાગી શકાય તો તે સંખ્યાને 6 વડે પણ ભાગી શકાય.",
  7: "",
  8: "જો આપેલ સંખ્યા નાં છેલ્લા ત્રણ અંકો (એકમ, દશક અને સો) દ્વારા રચાયેલી સંખ્યાને 8 વડે ભાગી શકાય તો આપેલ સંખ્યાને પણ 8 વડે ભાગી શકાય.",
  9: "જો આપેલ સંખ્યા નાં અંકોનો સરવાળો ૯ વડે વિભાજ્ય હોય તો આપેલ સંખ્યા પણ 9 વડે વિભાજ્ય છે તેમ કહેવાય.",
  10: "જો આપેલ સંખ્યાનો એકમનો અંક 0 હોય તો તે સંખ્યા 5 વડે વિભાજ્ય છે તેમ કહેવાય.",
  11: "કોઈ પણ સંખ્યાને ૧૧ વડે ભાગી શકાય તેવી સંખ્યા શોધવા માટે જમણી બાજુથી એકી સ્થાનોએ આવેલ અંકોના સરવાળા અને બેકી સ્થાનોએ આવેલા અંકોના સરવાળા વચ્ચેનો તફાવત ૦ અથવા ૧૧ વડે ભાગી શકાય તો તે સંખ્યા પણ ૧૧ વડે ભાગી શકાય.",
};

export const arithmeticMap = {
  ADDITION: 1,
  SUBTRACTION: 2,
  MULTIPLICATION: 3,
  DIVISION: 4,
};

export const difficultyMap = {
  EASY: 1,
  NORMAL: 2,
  HARD: 3,
};

export const difficultyRange = {
  EASY: [1, 50],
  NORMAL: [1, 30],
  HARD: [1, 20],
};
